title: Clear Linux Logs
status: stable
description: Detects clear logs
author: Ömer Günal, oscd.community
date: 2020/10/07
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.002/T1070.002.md
logsource:
  product: linux
  category: process_creation
detection:
  selection1:
    exe:
      - '*/rm'    # covers /rmdir as well
      - '*/shred'
  selection2:
    argv:
      - '*/var/log*'
      - '*/var/spool/mail*'
  condition: selection1 and selection2
falsepositives:
  - Legitimate administration activities
level: medium
tags:
  - attack.defense_evasion
