title: Clear Command History
status: experimental
description: Clear command history in linux which is used for defense evasion.
author: Liu yx
date: 2021/03/18
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1146/T1146.yaml
    - https://attack.mitre.org/techniques/T1146/
logsource:
    product: linux
detection:
  keywords:
    - 'rm *bash_history'
    - 'echo "" > *bash_history'
    - 'cat /dev/null > *bash_history'
    - 'ln -sf /dev/null *bash_history'
    - 'truncate -s0 *bash_history'
    # - 'unset HISTFILE'  # prone to false positives
    - 'export HISTFILESIZE=0'
    - 'history -c'
    - 'history -w'
    - 'shred *bash_history'
    - 'empty_bash_history'
  condition: keywords
falsepositives:
    - Legitimate administration activities
level: high
tags:
    - attack.defense_evasion