title: Local Groups Discovery
id: 676381a6-15ca-4d73-a9c8-6a22e970b90d
status: experimental
description: Detects enumeration of local system groups
author: Ömer Günal, Alejandro Ortuno, oscd.community
date: 2020/10/11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.001/T1069.001.md
detection:
  selection1:
    exe:
      - '*/groups'
  selection2:
    comm:
      - 'cat'
    argv:
      - '*/etc/group*'
  condition: selection1 or selection2
falsepositives:
  - Legitimate administration activities
logsource:
  category: process_creation
  product: linux
level: low
tags:
  - attack.discovery
