title: Process Discovery
status: stable
description: Detects process discovery commands
author: Ömer Günal, oscd.community
date: 2020/10/06
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1057/T1057.md
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    - comm:
        - 'ps'
        - 'top'
  condition: selection
falsepositives:
  - Legitimate administration activities
level: informational
tags:
  - attack.discovery