action: global
title: System Information Discovery
id: 42df45e7-e6e9-43b5-8f26-bec5b39cc239
status: stable
description: Detects system information discovery commands
author: Ömer Günal, oscd.community
date: 2020/10/08
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1082/T1082.md
logsource:
  category: process_creation
detection:
  selection:
    comm:
      - 'uname'
      - 'hostname'
      - 'uptime'
      - 'lspci'
      - 'dmidecode'
      - 'lscpu'
      - 'lsmod'
      - 'lsb_release'
  condition: selection
falsepositives:
  - Legitimate administration activities
level: informational
tags:
  - attack.discovery