title: File and Directory Discovery
id: d3feb4ee-ff1d-4d3d-bd10-5b28a238cc72
status: experimental
description: Detects usage of system utilities to discover files and directories
author: Daniil Yugoslavskiy, oscd.community
date: 2020/10/19
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1083/T1083.md
logsource:
  category: process_creation
  product: linux
detection:
  selection1:
    comm:
      - 'ls'
      - 'll'
      - 'find'
  condition: selection
falsepositives:
  - Legitimate activities
level: informational
tags:
  - attack.discovery