title: Remote File Copy
id: 7a14080d-a048-4de8-ae58-604ce58a795b
status: stable
description: Detects the use of tools that copy files from or to remote systems
author: Omer Gunal
date: 2020/06/18
references:
  - https://attack.mitre.org/techniques/T1105/
logsource:
  product: linux
detection:
  selection1:
     argv|contains:
      - 'scp'
      - 'sftp'
      - 'rsync -r'
  selection2:
     argv|contains:
      - '@'
  condition: selection1 and selection2
falsepositives:
  - Legitimate administration activities
level: low
tags:
  - attack.command_and_control
  - attack.lateral_movement
