title: Password Policy Discovery
status: stable
description: Detects password policy discovery commands
author: Ömer Günal, oscd.community
date: 2020/10/08
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1201/T1201.md
logsource:
  product: linux
detection:
  selection:
    argv:
      - '*/etc/pam.d/common-password'
      - '*/etc/security/pwquality.conf'
      - '*/etc/pam.d/system-auth'
      - '*/etc/login.defs'
  condition: selection
falsepositives:
  - Legitimate administration activities
level: low
tags:
  - attack.discovery
