title: Scheduled Cron Task/Job
status: experimental
description: Detects abuse of the cron utility to perform task scheduling for initial or recurring execution of malicious code. Detection will focus on crontab jobs uploaded from the tmp folder.
author: Alejandro Ortuno, oscd.community
date: 2020/10/06
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1053.003/T1053.003.md
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    comm:
      - 'crontab'
    argv:
      - '/tmp/'
  condition: selection
falsepositives:
  - Legitimate administration activities
level: medium
tags:
  - attack.execution
  - attack.persistence
  - attack.privilege_escalation
