title: Local Groups Discovery
id: 676381a6-15ca-4d73-a9c8-6a22e970b90d
status: experimental
description: The reverse shell behaviour on Linux
author: Ömer Günal, Alejandro Ortuno, oscd.community
date: 2020/10/11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.001/T1069.001.md
detection:
  selection1:
    argv:
      - '*/bin/bash -i*'
      - '/bin/sh -i'
      - '*0>&1*'
  selection2:
    ppid_argv:
        - '*2>&1*'
  condition: selection1 or selection2
falsepositives:
  - Legitimate administration activities
logsource:
  category: process_creation
  product: linux
level: medium
tags:
  - attack.command_and_control
